qualcomm/qcom-test-automation-controller/source/library/src/PIC32CXPlatformConfiguration.cpp
// Copyright (c) Qualcomm Technologies, Inc. and/or its subsidiaries.
//
// Redistribution and use in source and binary forms, with or without
// modification, are permitted (subject to the limitations in the
// disclaimer below) provided that the following conditions are met:
//
//     * Redistributions of source code must retain the above copyright
//         notice, this list of conditions and the following disclaimer.
//
//     * Redistributions in binary form must reproduce the above
//         copyright notice, this list of conditions and the following
//         disclaimer in the documentation and/or other materials provided
//         with the distribution.
//
//     * Neither the name of Qualcomm Technologies, Inc. nor the names of its
//         contributors may be used to endorse or promote products derived
//         from this software without specific prior written permission.
//
// NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE
// GRANTED BY THIS LICENSE. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT
// HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED
// WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
// MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
// IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
// ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
// DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
// GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
// INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER
// IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
// OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN
// IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

#include <qtac/PIC32CXPlatformConfiguration.h>
#include <qtac/StringUtilities.h>

#include <algorithm>
#include <stdexcept>

// JSON key constants
static const char* kPlatformEntries = "pins";
static const char* kPinNumber       = "pin_number";
static const char* kEnabled         = "enabled";
static const char* kInverted        = "inverted";
static const char* kName            = "name";
static const char* kToolTip         = "help_hint";
static const char* kCommand         = "command";
static const char* kCommandGroup    = "command_group";
static const char* kTabName         = "tab_name";
static const char* kRunPriority     = "run_priority";
static const char* kButtons         = "buttons";
static const char* kVariables       = "variables";
static const char* kScript          = "script";
static const char* kModificationDate = "modification_date";
static const char* kFileVersion     = "fileVersion";
static const char* kLabel           = "label";
static const char* kTab             = "tab";
static const char* kCellLocation    = "cellLocation";
static const char* kDefaultValue    = "default_value";
static const char* kType            = "type";

// ---------------------------------------------------------------------------

_PIC32CXPlatformConfiguration::_PIC32CXPlatformConfiguration()
{
    initialize();
}

// ---------------------------------------------------------------------------
// Pin list accessors
// ---------------------------------------------------------------------------

Pins _PIC32CXPlatformConfiguration::getPins()
{
    Pins result;
    PIC32CXPinList active = getActivePins();
    for (const auto& p : active)
    {
        PinEntry pe;
        pe._pin          = p._setPin;
        pe._enabled      = p._enabled;
        pe._hash         = p._hash;
        pe._cellLocation = p._cellLocation;
        pe._commandGroup = p._commandGroup;
        pe._pinCommand   = p._pinCommand;
        pe._inverted     = p._inverted;
        pe._pinLabel     = p._pinLabel;
        pe._pinTooltip   = p._pinTooltip;
        pe._tabName      = p._tabName;
        result.append(pe);
    }

    std::sort(result.begin(), result.end(), [](const PinEntry& a, const PinEntry& b) {
        if (a._tabName != b._tabName)           return a._tabName < b._tabName;
        if (a._commandGroup != b._commandGroup) return a._commandGroup < b._commandGroup;
        return a._pin < b._pin;
    });
    return result;
}

PIC32CXPinList _PIC32CXPlatformConfiguration::getAllPins()
{
    PIC32CXPinList result;
    for (const auto& kv : _pinEntries)
        result.append(kv.second);
    std::sort(result.begin(), result.end(), [](const PIC32CXPinData& a, const PIC32CXPinData& b) {
        return a._setPin < b._setPin;
    });
    return result;
}

PIC32CXPinList _PIC32CXPlatformConfiguration::getActivePins()
{
    PIC32CXPinList result;
    for (const auto& kv : _pinEntries)
        if (kv.second._enabled)
            result.append(kv.second);
    std::sort(result.begin(), result.end(), [](const PIC32CXPinData& a, const PIC32CXPinData& b) {
        return a._setPin < b._setPin;
    });
    return result;
}

// ---------------------------------------------------------------------------
// Getters / setters
// ---------------------------------------------------------------------------

bool _PIC32CXPlatformConfiguration::getPinEnableState(PinID pinId) const
{
    auto it = _pinEntries.find(PIC32CXPinData::makePIC32CXHash(pinId));
    return (it != _pinEntries.end()) ? it->second._enabled : true;
}
void _PIC32CXPlatformConfiguration::setPinEnableState(HashType hash, bool newState)
{
    auto it = _pinEntries.find(hash);
    if (it == _pinEntries.end()) throw std::invalid_argument("setPinEnableState: invalid pin");
    it->second._enabled = newState;
}

bool _PIC32CXPlatformConfiguration::getPinInvertedState(PinID pinId) const
{
    auto it = _pinEntries.find(PIC32CXPinData::makePIC32CXHash(pinId));
    return (it != _pinEntries.end()) ? it->second._inverted : false;
}
void _PIC32CXPlatformConfiguration::setPinInvertedState(HashType hash, bool newState)
{
    auto it = _pinEntries.find(hash);
    if (it == _pinEntries.end()) throw std::invalid_argument("setPinInvertedState: invalid pin");
    it->second._inverted = newState;
}

qtac::String _PIC32CXPlatformConfiguration::getPinLabel(PinID pinId) const
{
    auto it = _pinEntries.find(PIC32CXPinData::makePIC32CXHash(pinId));
    return (it != _pinEntries.end()) ? it->second._pinLabel : qtac::String();
}
void _PIC32CXPlatformConfiguration::setPinLabel(HashType hash, const qtac::String& v)
{
    auto it = _pinEntries.find(hash);
    if (it == _pinEntries.end()) throw std::invalid_argument("setPinLabel: invalid pin");
    it->second._pinLabel = v;
}

