qualcomm/qcom-test-automation-controller/source/library/src/PIC32CXPlatformConfiguration.cpp
    return true;
}

void _PIC32CXPlatformConfiguration::loadDefaultScript(const qtac::String& scriptText)
{
    if (scriptText.isEmpty() || !_script.isEmpty())
        return;

    TACCommands cmds;
    PIC32CXPinList activePins = getActivePins();
    for (const auto& p : activePins)
    {
        if (p._pinCommand.isEmpty()) continue;
        TACCommand tc;
        tc._pin     = p._setPin;
        tc._command = p._pinCommand;
        cmds.append(tc);
    }
    _script.parseScript(scriptText, _variables, cmds);
}

void _PIC32CXPlatformConfiguration::write(json_t& j)
{
    boost::json::array pinsArray;
    for (const auto& kv : _pinEntries)
    {
        const PIC32CXPinData& p = kv.second;
        boost::json::object entry;
        entry[kPinNumber]    = static_cast<int>(p._setPin);
        entry[kEnabled]      = p._enabled;
        entry[kInverted]     = p._inverted;
        entry[kName]         = p._pinLabel.toStdString();
        entry[kToolTip]      = p._pinTooltip.toStdString();
        entry[kCommand]      = p._pinCommand.toStdString();
        entry[kCommandGroup] = static_cast<int>(p._commandGroup);
        entry[kRunPriority]  = fromPoint(p._cellLocation).toStdString();
        entry[kTabName]      = p._tabName.toStdString();
        pinsArray.push_back(entry);
    }
    j.as_object()[kPlatformEntries] = pinsArray;
}

// ---------------------------------------------------------------------------
// Factory defaults (ported from qcommon-console/PIC32CXPlatformConfiguration.cpp)
// ---------------------------------------------------------------------------

void _PIC32CXPlatformConfiguration::initialize()
{
    auto add = [&](PinID pin,
                   bool enabled,
                   bool inverted,
                   const char* label,
                   const char* cmd,
                   const char* tooltip,
                   CommandGroups group,
                   const char* tab,
                   qtac::Point cell)
    {
        PIC32CXPinData p(pin);
        p._enabled      = enabled;
        p._inverted     = inverted;
        p._pinLabel     = label ? label : "";
        p._pinCommand   = cmd ? cmd : "";
        p._pinTooltip   = tooltip ? tooltip : "";
        p._commandGroup = group;
        p._tabName      = tab;
        p._cellLocation = cell;
        _pinEntries[p._hash] = p;
    };

    add(3,   false, false, "JMI2C.2",              "iic2",           "Debug pin",                        eConnectionGroup,    "General", {-1,-1});
    add(4,   true,  false, "Battery",              "battery",        "Disconnects power to the device",  eConnectionGroup,    "General", { 0, 0});
    add(6,   true,  false, "KK Power Enable",      "kkpwr",          "Enables KK Power",                 eButtonGroup,        "General", { 0, 0});
    add(7,   true,  false, "MD PS HOLD",           "pshold",         "MD PS HOLD",                       eButtonGroup,        "General", { 1, 0});
    add(10,  true,  false, "KK Resin N",           "sresn",          "KK Resin N",                       eButtonGroup,        "General", { 2, 0});
    add(11,  false, false, "PMS Power On",         "pmspwr",         "PMS Power On",                     eButtonGroup,        "General", {-1,-1});
    add(16,  true,  false, "UEFI",                 "uefi",           "UEFI",                             eButtonGroup,        "General", { 0, 2});
    add(20,  true,  false, "Power Off",            "pkey",           "Power Off",                        eButtonGroup,        "General", { 0, 1});
    add(21,  true,  false, "PCIE0 Attention",      "pcie0",          "PCIE 0 Attention",                 eSwitchGroup,        "General", { 0, 0});
    add(27,  true,  false, "PCIE1 Attention",      "pcie1",          "PCIE 1 Attention",                 eSwitchGroup,        "General", { 1, 0});
    add(101, true,  false, "PCIE2 Attention",      "pcie2",          "PCIE 2 Attention",                 eSwitchGroup,        "General", { 2, 0});
    add(102, true,  false, "PCIE3 Attention",      "pcie3",          "PCIE 3 Attention",                 eSwitchGroup,        "General", { 0, 1});
    add(103, false, false, "JMI2C.10",             "iic10",          "Debug pin",                        eSwitchGroup,        "General", {-1,-1});
    add(110, false, false, "Kratos Trigger",       "kratos",         "Kratos Trigger",                   eSwitchGroup,        "General", {-1,-1});
    add(111, false, false, "JMI2C.4",              "iic4",           "Debug pin",                        eSwitchGroup,        "General", {-1,-1});
    add(114, false, false, "QCC BLD Disconnect",   "qccbld",         "QCC BLD Disconnect",               eButtonGroup,        "General", {-1,-1});
    add(115, false, false, "BB BLD Disconnect",    "bbbld",          "BB BLD Disconnect",                eSwitchGroup,        "General", {-1,-1});
    add(116, true,  false, "Secondary Fastboot",   "sfastboot",      "Fastboot SS",                      eSwitchGroup,        "General", { 1, 1});
    add(117, false, false, "JMI2C.5",              "iic5",           "Debug pin",                        eSwitchGroup,        "General", {-1,-1});
    add(118, false, false, "PG QAM VR4P5",         "inputvr4p5",     "PG QAM VR4P5",                     eButtonGroup,        "General", {-1,-1});
    add(119, false, false, "PG QAM SAIL VR3P3",    "inputvr3p3",     "PG QAM SAIL VR3P3",                eButtonGroup,        "General", {-1,-1});
    add(120, true,  false, "Force MD PS HOLD",     "forcemdpshold",  "Force MD PS HOLD",                 eButtonGroup,        "General", { 1, 1});
    add(121, true,  false, "Force SS PS HOLD",     "forcesspshold",  "Force SS PS HOLD",                 eButtonGroup,        "General", { 2, 1});
    add(123, false, false, "",                     "",               "",                                 eUnknownCommandGroup,"General", {-1,-1});
    add(128, true,  false, "USB0",                 "usb0",           "Disconnect USB0",                  eConnectionGroup,    "General", { 1, 0});
    add(129, false, false, "PMS PGOOD",            "pgood",          "-",                                eButtonGroup,        "General", { 4, 0});
    add(204, false, false, "",                     "",               "",                                 eUnknownCommandGroup,"General", {-1,-1});
    add(205, true,  false, "USB2",                 "usb2",           "USB 2 Disable",                    eConnectionGroup,    "General", { 0, 1});
    add(206, false, false, "Fast Power Off",       "inputpwr",       "Fast K Power Off Enable",          eButtonGroup,        "General", { 4, 2});
    add(207, true,  false, "Mode 0",               "mode0",          "Mode 0 for Primary SOC",           eButtonGroup,        "General", { 1, 2});
    add(215, true,  false, "Mode 1",               "mode1",          "Mode 1",                           eButtonGroup,        "General", { 2, 2});
    add(216, true,  false, "MD EDL",               "pedl",           "MD EDL",                           eButtonGroup,        "General", { 0, 3});
    add(217, false, false, "Mode 0",               "mode0",          "Mode 0",                           eButtonGroup,        "General", {-1,-1});
    add(219, true,  false, "SS EDL",               "sedl",           "SS EDL",                           eButtonGroup,        "General", { 1, 3});
    add(221, false, false, "JMI2C.13",             "iic13",          "Debug pin",                        eButtonGroup,        "General", {-1,-1});
    add(224, false, false, "PMS Fast Power Off",   "inputpoff",      "PMS Fast Power Off",               eUnknownCommandGroup,"General", {-1,-1});
    add(225, false, false, "PMS Enable",           "inputpms",       "PMS Enable",                       eUnknownCommandGroup,"General", {-1,-1});
    add(226, false, false, "BB BLD EN",            "bbblden",        "-",                                eButtonGroup,        "General", {-1,-1});
    add(227, false, false, "QCC BLD EN",           "qccblden",       "-",                                eButtonGroup,        "General", {-1,-1});
    add(228, false, false, "Mode 2",               "mode2",          "Mode 2",                           eSwitchGroup,        "General", {-1,-1});
    add(311, true,  false, "EUD",                  "eud",            "EUD for Primary SOC",              eButtonGroup,        "General", { 2, 3});
    add(312, true,  false, "USB1",                 "usb1",           "USB1 Disconnect",                  eConnectionGroup,    "General", { 2, 0});
    add(320, false, false, "JMI2C.7",              "iic7",           "Debug I2C 7",                      eButtonGroup,        "General", {-1,-1});
    add(321, true,  false, "Fastboot MD",          "fastboot",       "MD Fastboot",                      eSwitchGroup,        "General", { 2, 1});
}
